<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"6e60c547f23fcf4efc3c6431dab59969bff1cd082d84c882ead0454a9f1b2d61","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #928 at https://github.com/cal-itp/data-infra/actions/runs/19146724468","plan_out_hash":"138fc89f0091bb8240955684570aa103c752361c2502a6bedf34654f1d559ab1","plan_hash":"6ae08494b8a4e08d4293d010c7415848318eb807be52ab3a1634648458ed8f36","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["plugins/hooks/ckan_hook.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "cvCBJA==" -> (known after apply)
!~      detect_md5hash      = "J2xA45EW8ESMizBsN82lSw==" -> "different hash"
!~      generation          = 1762451777650405 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/hooks/ckan_hook.py"
!~      md5hash             = "J2xA45EW8ESMizBsN82lSw==" -> (known after apply)
        name                = "plugins/hooks/ckan_hook.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/gcs_to_ckan_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "WLHcMg==" -> (known after apply)
!~      detect_md5hash      = "drdBrdm7TDjGRZTKN9H27Q==" -> "different hash"
!~      generation          = 1762455027304100 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/gcs_to_ckan_operator.py"
!~      md5hash             = "drdBrdm7TDjGRZTKN9H27Q==" -> (known after apply)
        name                = "plugins/operators/gcs_to_ckan_operator.py"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #928](https://github.com/cal-itp/data-infra/actions/runs/19146724468)